---
type: ContextualHelp
namespace: Autodesk.Revit.UI
version: 2024
members: 5
tags: [revit-api, class]
---

# ContextualHelp

`Autodesk.Revit.UI.ContextualHelp` · Revit 2024 · 5 members

| Kind | Member | Since | Signature |
| --- | --- | --- | --- |
| Constructor | ContextualHelp | 2013 | `public ContextualHelp ( ContextualHelpType helpType , string helpPath )` |
| Method | Launch | 2013 | `public void Launch ()` |
| Property | HelpPath | 2013 | `public string HelpPath { get ; set ; }` |
| Property | HelpTopicUrl | 2013 | `public string HelpTopicUrl { get ; set ; }` |
| Property | HelpType | 2013 | `public ContextualHelpType HelpType { get ; set ; }` |